[TheWorld:PersistentLevel.H7VisitingShell_0 H7VisitingShell]
mDescription=""
mDescriptionInactive=""
mName="疯子"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_Quest_NewNode_0 H7SeqAct_Quest_NewNode]
mTitle="H7SeqAct_Quest_NewNode_0"
mDescription=""
mRewardText=""

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_Quest_NewNode_1 H7SeqAct_Quest_NewNode]
mTitle="H7SeqAct_Quest_NewNode_1"
mDescription=""
mRewardText=""

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_Quest_NewNode_10 H7SeqAct_Quest_NewNode]
mTitle="法术"
mDescription="拜访奥法圣所"
mRewardText="你是个法师"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_Quest_NewNode_11 H7SeqAct_Quest_NewNode]
mTitle="更多法术"
mDescription="拜访魔法行会"
mRewardText="你是个伟大的法师"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_Quest_NewNode_13 H7SeqAct_Quest_NewNode]
mTitle="拜访他岛上的疯子"
mDescription="疯子毕竟没那么疯。"
mRewardText="好的开始"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_Quest_NewNode_16 H7SeqAct_Quest_NewNode]
mTitle="大法师宫殿"
mDescription="拜访大法师宫殿"
mRewardText="非常好"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_Quest_NewNode_17 H7SeqAct_Quest_NewNode]
mTitle="被矮人偷走的戒指"
mDescription="取回被矮人偷走的戒指"
mRewardText="太棒了"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_Quest_NewNode_18 H7SeqAct_Quest_NewNode]
mTitle="维恩的头骨"
mDescription="取回维恩的头骨"
mRewardText="了不起"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_Quest_NewNode_2 H7SeqAct_Quest_NewNode]
mTitle="H7SeqAct_Quest_NewNode_2"
mDescription=""
mRewardText=""

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_Quest_NewNode_3 H7SeqAct_Quest_NewNode]
mTitle="H7SeqAct_Quest_NewNode_3"
mDescription=""
mRewardText=""

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_Quest_NewNode_4 H7SeqAct_Quest_NewNode]
mTitle="城镇等级10"
mDescription="城镇等级10"
mRewardText="好样的"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_Quest_NewNode_5 H7SeqAct_Quest_NewNode]
mTitle="城镇等级15"
mDescription="城镇等级15"
mRewardText="好样的"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_Quest_NewNode_6 H7SeqAct_Quest_NewNode]
mTitle="城镇等级20"
mDescription="城镇等级20"
mRewardText="好样的"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_Quest_NewNode_7 H7SeqAct_Quest_NewNode]
mTitle="英雄等级16"
mDescription="英雄等级16"
mRewardText="恭喜"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_Quest_NewNode_8 H7SeqAct_Quest_NewNode]
mTitle="矿工"
mDescription="占领所有矿场"
mRewardText="超级"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_Quest_NewNode_9 H7SeqAct_Quest_NewNode]
mTitle="黄金爱好者"
mDescription="占领金矿"
mRewardText="太棒了"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_QuestGroup_0 H7SeqAct_QuestGroup]
mTitle="疯子"
mDescription="疯子是他岛上唯一的居民"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_QuestObjective_0 H7SeqAct_QuestObjective]
mDescription="击败所有对手。若连续7天未控制任何城镇，或失去所有英雄和城镇，则你被击败。"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_QuestObjective_1 H7SeqAct_QuestObjective]
mDescription=""

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_QuestObjective_10 H7SeqAct_QuestObjective]
mDescription="城镇等级15"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_QuestObjective_11 H7SeqAct_QuestObjective]
mDescription="城镇等级20"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_QuestObjective_12 H7SeqAct_QuestObjective]
mDescription="英雄等级16"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_QuestObjective_13 H7SeqAct_QuestObjective]
mDescription="矿工"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_QuestObjective_14 H7SeqAct_QuestObjective]
mDescription="黄金爱好者"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_QuestObjective_15 H7SeqAct_QuestObjective]
mDescription="法术"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_QuestObjective_16 H7SeqAct_QuestObjective]
mDescription="更多法术"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_QuestObjective_19 H7SeqAct_QuestObjective]
mDescription="拜访他岛上的疯子"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_QuestObjective_2 H7SeqAct_QuestObjective]
mDescription="击败所有对手。若连续7天未控制任何城镇，或失去所有英雄和城镇，则你被击败。"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_QuestObjective_22 H7SeqAct_QuestObjective]
mDescription="大法师宫殿"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_QuestObjective_24 H7SeqAct_QuestObjective]
mDescription="被矮人偷走的戒指"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_QuestObjective_25 H7SeqAct_QuestObjective]
mDescription="维恩的头骨"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_QuestObjective_3 H7SeqAct_QuestObjective]
mDescription=""

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_QuestObjective_4 H7SeqAct_QuestObjective]
mDescription="击败所有对手。若连续7天未控制任何城镇，或失去所有英雄和城镇，则你被击败。"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_QuestObjective_5 H7SeqAct_QuestObjective]
mDescription=""

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_QuestObjective_6 H7SeqAct_QuestObjective]
mDescription="击败所有对手。若连续7天未控制任何城镇，或失去所有英雄和城镇，则你被击败。"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_QuestObjective_7 H7SeqAct_QuestObjective]
mDescription=""

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_QuestObjective_8 H7SeqAct_QuestObjective]
mDescription="城镇等级10"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_13.H7SeqAct_ShowDialogue_0 H7SeqAct_ShowDialogue]
mLines[0]_Content="欢迎，年轻的英雄。\r\n如果你和我一样疯狂，我有个任务要交给你。"
mLines[1]_Content="和你一样疯狂？"
mLines[2]_Content="是的，和我一样疯狂，因为如果你失败了，你就会死！"
mLines[3]_Content="如果我成功了呢？"
mLines[4]_Content="如果你成功了，那你比我还疯！"
mLines[5]_Content="这个任务是什么？"
mLines[6]_Content="首先，你必须将大法师宫殿从占据那里的那些小怪物手中解放出来。"
mLines[7]_Content="这似乎没那么难……"
mLines[8]_Content="既然你这么说……"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_13.H7SeqAct_ShowDialogue_1 H7SeqAct_ShowDialogue]
mLines[0]_Content="啊，看来你终究是个伟大的英雄……"
mLines[1]_Content="真好笑……我就需要做这些吗？"
mLines[2]_Content="哈哈哈！当然不是！"
mLines[3]_Content="好吧，你还想让我做什么？"
mLines[4]_Content="那些矮人，那些恶棍，偷了我的戒指。把它给我拿回来！"
mLines[5]_Content="但是……我去哪儿找那些矮人？"
mLines[6]_Content="很简单，他们在我岛南边有个银行。"
mLines[7]_Content="哦，好的，我马上就去。"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_13.H7SeqAct_ShowDialogue_2 H7SeqAct_ShowDialogue]
mLines[0]_Content="你肯定比我想象的还要强……"
mLines[1]_Content="你为什么这么说？"
mLines[2]_Content="因为如果你失败了，你就会死，而我就可以幸灾乐祸了！"
mLines[3]_Content="你真是疯了！"
mLines[4]_Content="别侮辱我，否则你会付出代价！"
mLines[5]_Content="好吧，这还没完，但有很多敌对英雄试图入侵我的领地，所以如果你还有任务要交给我，请快点告诉我。"
mLines[6]_Content="很好，小小的凡人。去拜访一下死龙。它们正贪婪地守护着另一件属于我的物品。"
mLines[7]_Content="是什么？"
mLines[8]_Content="是我的战友维恩的火热头骨。他曾给我带来如此多的灵魂，我觉得欠他的……"
mLines[9]_Content="如果我把他的头骨带来，你拿什么回报我？"
mLines[10]_Content="生命！"
mLines[11]_Content="我还活着！你到底会给我什么奖励？"
mLines[12]_Content="你真是个强硬的谈判者，年轻的凡人……如果你把维恩的头骨带给我，我就饶你一命，并把复活石给你。"
mLines[13]_Content="传说中的复活石？"
mLines[14]_Content="正是那块！但如果你失败了，你不仅会死，你的灵魂也将属于我！"
mLines[15]_Content="很好，我接受！"
mlines[16]_Content="哈，哈，哈！你绝对比我还疯！"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_13.H7SeqAct_ShowDialogue_3 H7SeqAct_ShowDialogue]
mLines[0]_Content="难以置信，你做到了！"
mlines[1]_Content="当然，你曾怀疑过我吗？"
mlines[2]_Content="倒不如说我从未怀疑过你有能力成功！"
mlines[3]_Content="好吧，这还没完，但交易就是交易！\r\n把复活石给我！"
mlines[4]_Content="很好，这是你应得的，所以我暂时借给你复活石。"
mlines[5]_Content="不，是给我！"
mlines[6]_Content="你这可怜的傻瓜！你以为一个凡人能打败死神吗？等你死了，我就把我的复活石拿回来！\r\n在此期间，你可以走了，年轻的凡人英雄……"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_13.H7SeqAct_ShowText_0 H7SeqAct_ShowText]
mText="传说在北岛的最北端住着一个疯子。\r\n所有拜访过他的人都神秘地失踪了……\r\n你会比他们更勇敢吗？"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_13.H7SeqAct_ShowText_1 H7SeqAct_ShowText]
mText="看来你的友好邻居有能力使用传送器直接抵达你的岛屿……\r\n修建防御工事或许不是个坏主意……"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_13.H7SeqAct_ShowText_2 H7SeqAct_ShowText]
mText="似乎有个小偷设法闯入你的藏宝室，偷走了黄金和资源……\r\n而这个恶棍很可能会每晚都这样做！"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_13.H7SeqAct_ShowText_3 H7SeqAct_ShowText]
mText="在解救了他的母亲阿丽西亚，并找到了他的父亲托尔加尔和妹妹鲁芙之后，乔兰在一个小岛上休息了……\r\n但这真的是个好主意吗？"

[TheWorld:PersistentLevel.WorldInfo_0.H7MapInfo_0 H7MapInfo]
mName="愚人之岛"
mDescription="战争来临！因为一些琐碎的理由，你三位\"可爱的邻居\"已向你宣战并准备入侵。\r\n但在你自己的岛屿以北，传说住着一个疯子。\r\n也许去拜访他一下不是个坏主意？为你自己选择寒霜之塔，并为AI玩家选择你喜欢的阵营。\r\n为每个AI选择\"英雄\"难度（左侧）。\r\n这个战役并不简单……\r\n需要英雄无敌7.5版本1.40或更高版本。"

[Town_Garrison.H7RandomTown_0_Garrison H7AdventureArmy]
mName=""

[Town_Garrison.H7RandomTown_107_Garrison H7AdventureArmy]
mName=""

[Town_Garrison.H7RandomTown_163_Garrison H7AdventureArmy]
mName=""

[Town_Garrison.H7RandomTown_1_Garrison H7AdventureArmy]
mName=""

[Town_Garrison.H7RandomTown_3_Garrison H7AdventureArmy]
mName=""

[Town_Garrison.H7RandomTown_48_Garrison H7AdventureArmy]
mName=""